import { Text } from '@urban-bot/core';
import CaloriesCounter from './CaloriesCounter';

export default function Introduction() {
    return (
        <>
            <Text>
                <b>Давайте знайомитись з тими, хто вперше на марафоні.</b> <br />
                <br />{' '}
                <i>
                    Мене звати <b>Аверіна Дар`я</b>, я сертифікований інструктор із здорового харчування та дієтології,
                    спеціаліст у сфері психології схуднення. Захоплення мого життя - допомагати дівчатам ставати
                    стрункішими!
                </i>{' '}
                <br /> <br /> <b>З 2019 року</b> я успішно проводжу авторські антицелюлітні марафони на яких дівчата
                скинули більше 1000 кг загалом. <br /> <br />
                <b>З 14 років</b> я боролась з зайвою вагою шляхом дієт, голодування, пігулок схуднення, важких
                тренувань. Але вага постійно поверталась, тому що після важких дієт були періоди `зажору`.
                <br /> <br />
                <i>
                    Розуміння того, що дієти - шлях в нікуди, привели мене до навчання в двох міжнародних школах
                    дієтології `Баланс` та `Олимпія`, де я навчалась у кращих сучасних дієтологів.
                </i>{' '}
                <br /> <br />
                <i>
                    Розуміння того, що процес схуднення нерозривно пов`язан з психологією особистості, привело мене до
                    отримання другої вищої освіти з соціальної роботи та психології.
                </i>{' '}
                <br /> <br /> Сукупність отриманих знань дозволила створити власну систему харчування для успішної
                втрати ваги, якою я ділюсь з вами на марафонах. Рада збільшенню нашої марафонської родини. Разом ми
                сила! 💪💪💪
            </Text>
            <Text>Тепер порахуємо вашу норму калорій на день</Text>
            <CaloriesCounter />
        </>
    );
}
